<details>
<summary>Execution result of "plan" in "stack/github/prod/saas/system/github"</summary>

```terraform
17:51:56.841 WARN   The `TF_INPUT` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_NON_INTERACTIVE=true` instead.
17:51:57.900 STDOUT terraform: module.accounts.github_membership.members["techtrials-github-admin"]: Refreshing state... [id=random-builds:techtrials-github-admin]
17:51:57.900 STDOUT terraform: module.accounts.github_team.team["devops"]: Refreshing state... [id=12768767]
17:51:57.900 STDOUT terraform: module.accounts.github_team.team["domain1"]: Refreshing state... [id=12768766]
17:51:57.900 STDOUT terraform: module.accounts.github_team.team["admin"]: Refreshing state... [id=12768765]
17:51:57.900 STDOUT terraform: module.accounts.github_membership.members["techtrials-github-user1"]: Refreshing state... [id=random-builds:techtrials-github-user1]
17:51:57.900 STDOUT terraform: module.accounts.github_team.team["domain2"]: Refreshing state... [id=12768764]
17:51:57.903 STDOUT terraform: module.tf-module-github.github_repository.repository: Refreshing state... [id=tf-module-github]
17:51:57.903 STDOUT terraform: module.accounts.github_membership.members["techtrials-github-user2"]: Refreshing state... [id=random-builds:techtrials-github-user2]
17:51:57.903 STDOUT terraform: module.accounts.github_team.team["engineers"]: Refreshing state... [id=12768763]
17:51:58.509 STDOUT terraform: module.accounts.github_team_membership.team_membership["techtrials-github-user1-engineers"]: Refreshing state... [id=12768763:techtrials-github-user1]
17:51:58.509 STDOUT terraform: module.accounts.github_team_membership.team_membership["techtrials-github-admin-admin"]: Refreshing state... [id=12768765:techtrials-github-admin]
17:51:58.509 STDOUT terraform: module.accounts.github_team_membership.team_membership["techtrials-github-user1-devops"]: Refreshing state... [id=12768767:techtrials-github-user1]
17:51:58.509 STDOUT terraform: module.accounts.github_team_membership.team_membership["techtrials-github-user2-engineers"]: Refreshing state... [id=12768763:techtrials-github-user2]
17:51:58.510 STDOUT terraform: module.accounts.github_team_membership.team_membership["techtrials-github-user2-domain1"]: Refreshing state... [id=12768766:techtrials-github-user2]
17:51:59.230 STDOUT terraform: module.tf-module-github.github_repository_dependabot_security_updates.this: Refreshing state... [id=tf-module-github]
17:51:59.233 STDOUT terraform: module.tf-module-github.github_branch_protection.branch_protection: Refreshing state... [id=BPR_kwDOOYaYJc4Dric-]
17:51:59.494 STDOUT terraform: Terraform used the selected providers to generate the following execution
17:51:59.494 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
17:51:59.494 STDOUT terraform:   + create
17:51:59.494 STDOUT terraform:   ~ update in-place
17:51:59.494 STDOUT terraform:   - destroy
17:51:59.494 STDOUT terraform: Terraform will perform the following actions:
17:51:59.494 STDOUT terraform:   # module.accounts.github_team.team["domain2"] will be destroyed
17:51:59.494 STDOUT terraform:   # (because key ["domain2"] is not in for_each map)
17:51:59.494 STDOUT terraform:   - resource "github_team" "team" {
17:51:59.494 STDOUT terraform:       - create_default_maintainer = false -> null
17:51:59.495 STDOUT terraform:       - etag                      = "W/\"a4a95fdab590c76d38ae65b8d1e7e70e1b5c3a7d31156863fc879d1e2faeb795\"" -> null
17:51:59.495 STDOUT terraform:       - id                        = "12768764" -> null
17:51:59.495 STDOUT terraform:       - members_count             = 0 -> null
17:51:59.495 STDOUT terraform:       - name                      = "domain2" -> null
17:51:59.495 STDOUT terraform:       - node_id                   = "T_kwDOCGmmvs4AwtX8" -> null
17:51:59.495 STDOUT terraform:       - privacy                   = "secret" -> null
17:51:59.495 STDOUT terraform:       - slug                      = "domain2" -> null
17:51:59.495 STDOUT terraform:         # (5 unchanged attributes hidden)
17:51:59.495 STDOUT terraform:     }
17:51:59.495 STDOUT terraform:   # module.accounts.github_team.team["domain23"] will be created
17:51:59.495 STDOUT terraform:   + resource "github_team" "team" {
17:51:59.495 STDOUT terraform:       + create_default_maintainer = false
17:51:59.496 STDOUT terraform:       + etag                      = (known after apply)
17:51:59.496 STDOUT terraform:       + id                        = (known after apply)
17:51:59.496 STDOUT terraform:       + members_count             = (known after apply)
17:51:59.496 STDOUT terraform:       + name                      = "domain23"
17:51:59.496 STDOUT terraform:       + node_id                   = (known after apply)
17:51:59.496 STDOUT terraform:       + parent_team_read_id       = (known after apply)
17:51:59.496 STDOUT terraform:       + parent_team_read_slug     = (known after apply)
17:51:59.496 STDOUT terraform:       + privacy                   = "secret"
17:51:59.496 STDOUT terraform:       + slug                      = (known after apply)
17:51:59.496 STDOUT terraform:         # (1 unchanged attribute hidden)
17:51:59.496 STDOUT terraform:     }
17:51:59.496 STDOUT terraform:   # module.accounts.github_team_membership.team_membership["techtrials-github-admin-admin"] will be updated in-place
17:51:59.496 STDOUT terraform:   ~ resource "github_team_membership" "team_membership" {
17:51:59.497 STDOUT terraform:         id       = "12768765:techtrials-github-admin"
17:51:59.497 STDOUT terraform:       ~ role     = "maintainer" -> "member"
17:51:59.497 STDOUT terraform:         # (3 unchanged attributes hidden)
17:51:59.497 STDOUT terraform:     }
17:51:59.497 STDOUT terraform: Plan: 1 to add, 1 to change, 1 to destroy.
17:51:59.497 STDOUT terraform: 
```

</details>
    
